app/controllers/articles_controller.rb

SELECT "articles".* FROM "articles" WHERE "articles"."id" = 2 LIMIT 1
---
  def edit
    @article = current_user.articles.find(params[:id])

INSERT INTO "articles" ("title", "body", "published_at", "created_at", "updated_at", "excerpt", "location", "user_id") VALUES ('Hello', 'OK', '2011-06-06 10:03:00.000000', '2011-06-06 10:03:53.261649', '2011-06-06 10:03:53.261649', '', '', NULL)
---
  def create
    @article = current_user.articles.new(params[:article])

    respond_to do |format|
      if @article.save

SELECT "articles".* FROM "articles" WHERE "articles"."id" = 1 LIMIT 1
DELETE FROM "articles" WHERE "articles"."id" = 1
---
  def destroy
    @article = current_user.articles.find(params[:id])
    @article.destroy