app/controllers/comments_controller.rb

  def create
    @comment = @article.comments.new(params[:comment])
    if @comment.save
---
INSERT INTO "comments" ("article_id", "name", "email", "body", "created_at", "updated_at") VALUES (3, 'Alexander', 'aexander@aesd.com', 'wweewewewe', '2011-06-06 17:38:22.102437', '2011-06-06 17:38:22.102437')

  def destroy
    @article = current_user.articles.find(params[:article_id])
    @comment = @article.comments.find(params[:id])
    @comment.destroy
---
SELECT "articles".* FROM "articles" WHERE "articles"."id" = 2 LIMIT 1
SELECT "comments".* FROM "comments" WHERE "comments"."id" = 1 AND ("comments".article_id = 2) LIMIT 1
DELETE FROM "comments" WHERE "comments"."id" = 1

    def load_article
      @article = Article.find(params[:article_id])
---
SELECT "articles".* FROM "articles" WHERE "articles"."id" = 5 LIMIT 1