app/controllers/users_controller.rb

INSERT INTO "users" ("email", "hashed_password", "created_at", "updated_at") VALUES ('vinokourov@inet.ua', '91ed47d80ff755ad3cd18bdaa2f730aa9bafc9ad', '2011-06-12 09:48:41.332583', '2011-06-12 09:48:41.332583')
---
  def create
    @user = User.new(params[:user])
    if @user.save